/* automatically generated by rust-bindgen */

pub type __u8 = ::std::os::raw::c_uchar;
pub type __u32 = ::std::os::raw::c_uint;
pub type __u64 = ::std::os::raw::c_ulonglong;
pub const obd_statfs_state_OS_STATE_DEGRADED: obd_statfs_state = 1;
pub const obd_statfs_state_OS_STATE_READONLY: obd_statfs_state = 2;
pub const obd_statfs_state_OS_STATE_NOPRECREATE: obd_statfs_state = 4;
pub const obd_statfs_state_OS_STATE_ENOSPC: obd_statfs_state = 32;
pub const obd_statfs_state_OS_STATE_ENOINO: obd_statfs_state = 64;
pub type obd_statfs_state = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct obd_statfs {
    pub os_type: __u64,
    pub os_blocks: __u64,
    pub os_bfree: __u64,
    pub os_bavail: __u64,
    pub os_files: __u64,
    pub os_ffree: __u64,
    pub os_fsid: [__u8; 40usize],
    pub os_bsize: __u32,
    pub os_namelen: __u32,
    pub os_maxbytes: __u64,
    pub os_state: __u32,
    pub os_fprecreated: __u32,
    pub os_spare2: __u32,
    pub os_spare3: __u32,
    pub os_spare4: __u32,
    pub os_spare5: __u32,
    pub os_spare6: __u32,
    pub os_spare7: __u32,
    pub os_spare8: __u32,
    pub os_spare9: __u32,
}
#[test]
fn bindgen_test_layout_obd_statfs() {
    assert_eq!(
        ::std::mem::size_of::<obd_statfs>(),
        144usize,
        concat!("Size of: ", stringify!(obd_statfs))
    );
    assert_eq!(
        ::std::mem::align_of::<obd_statfs>(),
        8usize,
        concat!("Alignment of ", stringify!(obd_statfs))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lu_fid {
    pub f_seq: __u64,
    pub f_oid: __u32,
    pub f_ver: __u32,
}
#[test]
fn bindgen_test_layout_lu_fid() {
    assert_eq!(
        ::std::mem::size_of::<lu_fid>(),
        16usize,
        concat!("Size of: ", stringify!(lu_fid))
    );
    assert_eq!(
        ::std::mem::align_of::<lu_fid>(),
        8usize,
        concat!("Alignment of ", stringify!(lu_fid))
    );
}
pub type lustre_fid = lu_fid;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct obd_uuid {
    pub uuid: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_obd_uuid() {
    assert_eq!(
        ::std::mem::size_of::<obd_uuid>(),
        40usize,
        concat!("Size of: ", stringify!(obd_uuid))
    );
    assert_eq!(
        ::std::mem::align_of::<obd_uuid>(),
        1usize,
        concat!("Alignment of ", stringify!(obd_uuid))
    );
}
extern "C" {
    pub fn llapi_obd_statfs(
        path: *mut ::std::os::raw::c_char,
        type_: __u32,
        index: __u32,
        stat_buf: *mut obd_statfs,
        uuid_buf: *mut obd_uuid,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn llapi_fid2path(
        device: *const ::std::os::raw::c_char,
        fidstr: *const ::std::os::raw::c_char,
        path: *mut ::std::os::raw::c_char,
        pathlen: ::std::os::raw::c_int,
        recno: *mut ::std::os::raw::c_longlong,
        linkno: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn llapi_path2fid(
        path: *const ::std::os::raw::c_char,
        fid: *mut lustre_fid,
    ) -> ::std::os::raw::c_int;
}
